---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceLoadContext.LoadOperationType
source: html/3622d2ec-b75c-d6dc-e52e-2a94b5dc891c.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadContext.LoadOperationType Property

An enum value indicating whether the resource load was triggered by an
 automatic event (such as file open) or an explicit user action.

## Syntax (C#)
```csharp
public LoadOperationType LoadOperationType { get; }
```